{"podcast_details": {"podcast_title": "What Next?", "episode_title": "Innovation and the absurdity of life: how staying curious is the key to great marketing", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/224c4db72c52cc491d4235f282bf880e.jpg", "episode_transcript": " Good morning, good afternoon, good evening. We have the opportunity today to listen to both an amazing person and a legend. His name is Alan Adamson. Today he is the co-founder of a company called Metaforce, but he is also an author. He is an adjunct professor at the New York Stern School of Business. He has been the chairman North America for many, many years of the very famous and legendary brand management, brand development firm of Landor. He also knows a lot about the agency space, having been spending a lot of time at companies like he was the senior vice president and group account director at Amaradei Puris, the group account director at DMBNP, which was eventually part of what now is Publisys. And he's also been at Ogilvy and Maffer and had some client-side experience at Unilever. Welcome, sir. Thank you for that lovely introduction. With that type of kickoff, I should probably end it now and say it's been a pleasure talking to you and I look forward to talking again. Fantastic. Fantastic. Well, you know, I've obviously given people a bit of your background. I'd like you to speak a little bit more about a couple of things. One, a little bit about Metaforce and a little bit about, you know, the new book that you have out there. Well, you know, I think where you learn your basics is important. And I thought I was going to be a filmmaker because I liked telling stories visually and realized that I was maybe pretty good at it. But as most people know, you have to be phenomenal at it and lucky. And so I had never thought I would go into the advertising business. I didn't have a role model. You know, there weren't anyone. I really didn't know anything about it. But I met some folks who said you should go talk to Ogilvy. And back in those days, Ogilvy was a great place to learn things because I think they taught me all the things they taught me. They taught me two critical skills because they had a training program every week. And one was how to write for business, how to get, you know, an idea across in writing. When you're in university, you learn how to write for people who want to read. At Ogilvy, I learned how to write sharp emails, sharp points of view, sharp recommendations. Being able to communicate a concept is, you know, is not an intuitive skill. So I learned that. And I learned early on how to do presentations because in most business that happens today, if you're trying to motivate people to take a certain action, you have to both lay it out in very succinct writing, short of the better. No one reads more than a couple bullets and be able to express that in a way that says, hey, we've never done that before. I've never seen that before. But maybe we should try that tomorrow. And, you know, that's sort of one of the challenges that I think is fascinating about our business is that success is more than just saying, hey, let's do what we did yesterday and do it again a little better today. The big, big opportunities to do something that has not been done yesterday and do it for the first time. Absolutely. And, you know, as we discussed, as you came along, one of your positions was at DMVNB where you had the opportunity to go visit a little company in Cincinnati. And we have a commonality in the fact that I began my career. And in those days, there was, you know, David Ogilvie's company, Doyle, you know, Bill Burnback's company and Leo Bonet's company. Those are the three big ones, BBDO, Ogilvie and Leo. And I was off to see Leo working on the P&G account. And we had to write those infamous one page memos. And I had to write one 56 times and I wanted to kill everybody who wanted me to rewrite it. And that's how we actually learned how to write, to your point. Yeah. People cannot comprehend that much. They want to make fast decisions. And if you can figure out in a one page email, a one page note, say, here's the challenge. Here's what you need to do. And here's why this answer or this recommendation or this perspective is critical. One, two, three, four. You know, it takes more to do that than write a rambling four page email. Absolutely. So, you know, you obviously become a legendary writer. You're a legendary expert in the world of brands and branding and differentiation and a lot of other things. So is that what MetaForce does? And is that what your new book is about? It's actually not because one of the challenges I've noticed over the past, when we started, when I started in my career, I worked at Unilever, as you mentioned. And in those days, you could develop a product that had a difference that mattered. And you could keep that advantage for a fair amount of time. You know, Dove really worked better than lots of other products on the market at that time. And as much as P&G tried, they couldn't match Dove's performance. So they had something called sustainable competitive advantage, something different that mattered. And you could just keep on telling that story. P&G had it with Dawn or Pampers. But those days are shrinking. You know, the time between you have a better mousetrap and three other people having the same mousetrap is instantaneous. And so building a brand based on only a difference, a product difference, is harder and harder to do these days. So as I sat down to think about what are the next challenges, it became clear that, you know, just saying just find some product difference and go tell people about that was flawed because product differences, you know, maybe don't are hard to find and certainly harder to sustain. And, you know, the world we live in is driven a lot by social media, people sharing, hey, have you tried this? And in general, people don't like sharing, I bought this new toothpaste and my teeth are 10% whiter. Yeah, you know, it's not. But they are sharing experiences. So part of this book was saying, look, you could have a product that has a difference, that's great. But if you could figure out how it fits in someone's lives, how it changes their lives, how it makes their experience better, that's a more relevant message today going forward. And the other big change that I see going on is that marketers for years have been handed something by product development. Here's a new shampoo, here's a new car, it has a new coffee cup holder that's easier to access, and then your job is to go sell that. But the problem is that, you know, marketing should be more focused on if we in marketing know who the customer is, know their problems, can get inside their head and do a Vulcan mind meld, if you go back to Star Trek, then we should be driving what sort of product experiences the company should do, not just taking whatever is invented in the lab, and then trying to find a way to make it relevant and interesting to people. So that's what seeing the house about. It's about one, encouraging marketers to stop just taking what is given to them and trying to, you know, sell it, which is not easy to do and is still a big part of marketing, but get more involved in innovation, get more involved in development of experiences, and try to zoom out from the product benefit. You know, how does this product fit? How does it make people want to share it? One of my favorite ideas came from Tom Friedman, the New York Times columnist, and he talks about in the hyper-connected world we live in, this notion of average is over. You know, if you only do things averagely, you're in real trouble today, but I think the same is true in marketing. If your marketing is only average, no one shares average. No one says, I took a plane ride to LA, the plane got there sort of on time, no one spilled anything on me, you know, they only took them 45 minutes to find my bag and put it on the carousel. People share extraordinarily good or externally bad. So one of my other key points is that if you try to do many things in marketing, you will likely be average at many things. And you'll do a TV commercial that's okay, you'll do some social media that's okay, you'll do an influencer strategy. You know, if you have too many things on your to-do list, you will just do them okay. But success is going to be more and more driven by doing a few things extraordinarily well. Did you see that phenomenal spot that Dove did on Real Beauty? Did you see that great social campaign that... And so another key point that over the years I've come to realize is that, you know, part of success in marketing is looking at what's out there, looking at your potential tools, looking at your tools and saying, you know, where am I going to be great at? You know, if I'm playing tennis, you know, I know I have a better forehand and backhand, you know, I better be shooting a lot more forehand shots, even though I can do a backhand and an overhead slam. And, you know, ultimately you have as a marketer say, what are my company's strengths? You know, what am I good at? And where can I do something extraordinarily well? Not just, all right, they've asked me to, you know, do some new packaging for my toothpaste. Let me try to do that. Fantastic. So I would say, you know, broadly your key overall, I would say, encompassing point is a couple. And, you know, one is sort of a line from your book that today differentiation itself isn't enough. You need sort of experience innovation. Yep. So it's about experiences and innovating. And I think another point you basically make is focus because those experiences have to be special and transformational. Exactly. Versus, as you say, average. So, you know, I've sort of completely believed that and I've written a piece called Tattoo Moments, which is you want to have a few to two moments with just having this stuff and a less polite way I describe it is instead of taking all your money and pissing it away, focus it and take a shit and people will know that you've shit on them versus pissed on them. Exactly. Stop the peanut butter approach and, you know, put all your chips on number black 22 and hope it wins. Yeah. So I think this big thing, which is differentiation itself is not enough and it's about experience innovation, about focus. And that is, you know, a big way of sort of thinking about and building sort of brands in the future. And I sometimes I want to be clear that I don't mean experience like build a Nike store or a Starbucks. You know, it could be small things. I love, you know, small things that make people. Amazon, a couple years back, decided that, you know, getting a text that your package had arrived was helpful. But far better would be if they sent you a picture of the box on your doorstep. And so that's a tiny little change in experience. But all of a sudden makes you feel much more comfortable that, oh, that's it's there, I better open the front door and get it. And it gives you far more comfort that the package is there than a text that's on its way. I took my car to the dealership to get it because of the first service was included. And I got a text from this car company. It was Audi. And they said, here, let me show you what we found. And they sent me a little video where they had me under my car and say, here are your brake linings. And all of a sudden, they were pointing out in a little video, you know, what was wrong versus the way it used to happen in my day. Somebody will call you up and say, Alan, you know, you need a new ball bearing 14 set. And while you wanted to believe them, you know, it was hard. Are you sure I really the thread is really that now all of a sudden, the simple thing about taking you onto the car where you couldn't normally crawl under yourself, showing you that the ball bearing is no longer there, or the thread is no. And so don't think of experience innovation as I need to build a Nike store, or the Apple store. Think of it in I think ways. How can you make your current using your product just, you know, it's back to even Starbucks when they started writing your name on the cup. You know, I think, you know, part of it is looking for ways to, to incrementally improve and not not to totally change how people do things. In many ways, I think, you know, what you're speaking about is little moments of delight. Exactly. You know, little moments of like, wow, surprise, you know, it's like, and I've had the same experience with, you know, another German automaker. And they sent me that video, but their video was really interesting. They begin by showing everything that's right. So they make me feel really cool. Right. And they say, Hey, by the way, there's this thing that is not completely the way it should be. So this is why we suggest this. So you first get positive reinforcement. Right. So everyone's so which gets to the other point, which is to succeed today, you have to figure out that first step. But then you have to constantly iterate and get it better. Because the minute you know, you show a little video of your brake linings, every car company is going to do that every local garage. So you have to really, and all of a sudden, you're in, they have to realize you're in the news business, you're in the TV, and you better be good at it. Yeah. And now what they do is they also basically they start with the person taking a picture of himself and says, Hello, I'm Alan. Exactly. I'm working on your car. Right. So you have more confidence that this person actually, and you know, if they're if it is a German car company, having him have a little bit of a German accent, also makes you believe you'll actually know how to use a screwdriver. Absolutely. So that, you know, I think is one very, very important point, this whole idea about experiences that can be small, it can be delightful, the idea about innovating around experiences was just differentiation. Now, your book, the title is seeing the how and I was reading a lot of stuff that you've been both speaking about and writing about. And I could talk about a lot of things. But one of the things that resonated with me a lot was looking at things with fresh eyes. Can you speak a little bit about that? I think that is your second key point. Yeah, because it's about seeing the how, which seems to be this fresh eyes. Yeah. And it seems like an obvious things. But you know, many times in our careers, we've been, yeah, I've worked on businesses where you go in and pick on one, you know, we're in the beer business for 20 years, Alan, this is how we market this beer, you know, and there is a there, you know, they're on autopilot. And expertise and knowledge is important. And but the problem is, seeing opportunities differently, once you're hardwired to say, I know how to change a tire going back to going back to autos, then you'll change the tire the same way all the time until someone shows you, hey, you ever wonder why you don't do this. And so I think part of marketing's challenges we all get, we all get myopic and no one keeping fresh eyes, meaning ability to look, I talk about it as, you know, when I used to take my five year old son walking on the street, he would, you know, see, look at that airplane, look at that car, you know, they they're seeing things, and we lose our curiosity, as we become more productive and more focused, and spend too much time just getting things done, and not enough time, you know, zooming out and seeing the world. I'll just go back to my started Ogilvy. I went through nine interviews at the company, back in those days, and I was very proud of myself. I knew the difference between one media plan and the other and market segmentation. And, you know, I thought I was really well prepared. And I meet the CEO who just does the final, you have a good day and makes you the offer or says, I don't know what my team is thinking. Good luck to you. But I go into the CEO's office. And in those days, they get a lot of the CEO's office. And in those days, they had, you know, Madison Avenue offices, people actually worked in offices. And so it was, you know, it's a little intimidating when you're first in there. And I was all ready for his first question on what marketing principles is he going to ask me about? And he said, I said, Alan, you know, tell me about the last book you read, the last movie you went to, and the last museum you went to, and what you learned. So I bumbled through it. And afterwards, I said, you know, Ken, why did you ask these questions? He said, well, you know, I want my frontline agency leaders to be the eyes and ears for my clients to see what's going on in the world, to be in touch with culture, to see around the corner. They're busy in conference rooms. They're busy in meetings. They, you know, you know, we need to help them use high beams to see what's down the road to help them seize opportunity to see and seize opportunities. You know, as a marketing person, writing a book is not that much fun. Trust me. But it's sort of a every four or five years, it forces me to get out of my bubble, talk to people I haven't met before, get into categories and to become curious again. And I think if you're in marketing, you need to try to keep your eyes fresh. Because if you can't keep your eyes fresh, you'll be less valuable and less successful. I definitely do agree with that. And I think, you know, one of the key things is, as you have also pointed out that in many cases, the opportunities and threats to your category tend to come from outside it. Which is, you know, Gillette did not see Dollar Shave Club. And the auto manufacturers didn't really take Tesla, Uber, seriously. Yeah, may not yet. Yeah. And they come from outside. And so what tends to happen is you start benchmarking against your existing competitors. And I often tell clients, all that you're doing is figuring out how to be less pathetic than other pathetic people. Right. Yeah, I mean, I'm one of the I remember this being in the Unilever cafeteria, which was a reasonably inexpensive place to have lunch in Manhattan back in those days. And, but I realized all of a sudden at the lunch table, we were saying, did you see what Colgate did last week? Did you see what P&G did in Cleveland? And we were so focused on, you know, you know, same when I worked with Pepsi, it was always about Coke. It was, oh, you know, it was never about bottled water back in those days. You know, it was only about how do we beat Coke? I do think that's easier said than done. Because if your lunch is being eaten by your competitor, of course, when you're playing tennis, you're focused on the other person. But if you play more golf, and look at the course, look at the way the wind's blowing, you know, look at, you know, many other things, but if you're only focused on the person right in front of your nose, you're also going to be playing a short game. I would agree. So, you know, those are two of your key points, which is one is this entire thing about innovation and experiences, experience innovation, the other is looking in a different way, you know, with completely fresh eyes, including by the way, for all of us in this world is to be aware of what's going around with regard to culture and change and a bunch of other things. You've got so many different things that you speak about. So in addition to those two, what would be a third big thing that you may want to share with people? This may sound cliches, but, you know, I think the people that are most successful in marketing really enjoy it. You know, when I have a client problem, and they say we're not growing, or our business is skewing older, I love solving nonlinear problems where you can't go out and ask customers, what do you want in a disposable diaper? And so part of, I think, success is also, you have to think about the challenge, not when you're in front of the computer, ready to type, you know, dear client, I recommend you do three things, you have to look at it from multiple angles, you have to iterate on it. And I sort of feel that part of problem solving is to, one is zoom out and look at other categories. Two is to speak to people who actually have no connection to the category. I have a lot of success by taking an idea and not going to heavy users of Froot Loops or cereals, but talking to people who don't eat cereals. And so I think that's the other piece is that it's really become much harder because in, I hate to keep on going back to the Madman days, but there was a time you could go and ask consumers, you know, what problem do you have that I can solve? You know, my soap is drying my skin or my diapers leak or, you know, but those are really hard things to do. And more often than not, you need to go from asking consumers to observing them and, you know, realizing that they don't see forward, they have rear view mirrors, they can see really clearly what happens. And to get them to be able to tell you what might be around the corner, you need to go to them with three bad ideas and say, what about this? Have you ever thought about this? And you need to bring them to life a little bit and then they can tell you, well, that's, I would never do that. But that's sort of interesting. This has become a more difficult business, more fragmentation, more clutter, more noise. But the basic challenge is still the same, which is understanding how you can make a customer or consumer's life better. And to do that, you can't read an executive summary research report, you know, once in a while, you know, going back to what we talked about P&G, other than the one page email that said, you know, here are three things that are important. They also back even back in those days, I would go to people's homes and sit at the kitchen table and wash them, wash dishes and talk. And, you know, I think being a good observer, I often talk about if, you know, if Jerry Seinfeld didn't make it in comedy, he'd be a great marketer. Because he has this sort of, you ever wonder why people do this? He has this curious look at the world, he can spot absurdities and things that we have just taken for granted. I think, you know, to some extent, the pandemic broke lots of those habits that we just assume that if you wanted to do a client meeting, you had to, you know, get on a plane and fly four hours and wait in reception and spend 32 minutes trying to plug in your laptop to the projector or find the link, and then present and then pack up and go. So I think part of success today is trying to be more open and curious and a better observer of what's going on. Yeah, I mean, my sense is, I think you're speaking very much about, if you look at and try to understand people, it's better than trying to ask consumers about your products and services. Right. Because in effect, people don't live through the lens of a brand. The moment you always look at the things from a lens of a brand. And to your point, to look at things through fresh eyes is obviously to observe people versus just, you know, how are they consuming your product or service, which I think is one. And second, this basic belief in your both curiosity, because the one thing today is AI is not curious. AI answers the curious questions. And in many ways, the future will be about framing the right question. Right. So that's your point about, you know, curiosity and curiosity in people requires both a passion for what you do and a passion for living. Yeah. That's the thing that comes through your book too. Yeah. And I, it sounds so obvious, but to be a good marketer, you have to be, you have to see what's going on, the title of my book, and seeing how people are living, seeing how they're thinking. And if you really see that clearly, you'll be a great marketer. Marketers, if they're really good at seeing how people live their lives and seeing what matters and are curious, they should take a bigger role in the innovation. They should not just think of themselves as, you know, I can buy the best social media package possible. They should get out of just executing and get into that marketer should really be inventing new things and bringing new customers and finding ways that they do. You ever think we should put, you know, let's do a camera under the car to show people, you know, that has to come from marketing, not from the lab. You know, I'm not no longer buying this phone because it has more pixels or, you know, a better screen. I'm buying this because when I have a problem, there's a human being I can call at Apple who will spend 40 minutes with me screen sharing on my phone to figure out how to get my contacts to work. You know, and that, you know, understanding that, again, it's not the product, it's experience, and how you make that experience matter, and how you make their lives a little better, because if you make it better, you're going to be a better person. And don't always look to the new. That's my final point. You know, everyone's saying, well, we have to, everyone's chasing the, it's like watching a seven-year-old's play football or soccer. Everyone's chasing the ball. But oftentimes going back and saying, what's the right tool to make this happen? I'm a big fan of, I've worked with Delta in the past, and I saw a friend of mine just got a million miles and, you know, showed a handwritten of the plan, thanking him, showed the way they celebrated this month. And it wasn't all an email or a text. It was old school. It was something hand done to show a personal, and of course, yes, the captain came back and, you know, talked to him. But the fact that he had in longhand written out, not just thank you very much, sign off, but a long note that was clearly written first person, that wasn't following corporate guidelines, that wasn't written by chat GBT. So as you think about marketing, remember that just because it's not on the cutting edge and it's not a TikTok video, doesn't mean that it can have dramatic impact in the market. Absolutely. I think seeing things from a human perspective, as you basically mentioned, is important. We've had the privilege of listening to an amazing gentleman, Alan Adamson, with a lot of experience. And he has shared three key points with us. The first is, while differentiation may be hard to get, experiences and innovation and experience innovation, including moments of delight, or what I call to two moments become extremely critical. The second is in today's world, to innovate, one has to look with fresh eyes, look broader and more differently than just look at people through from a consumer perspective. Curiosity is not something that killed the cat, but the lack of curiosity today will probably kill the cat. So curiosity becomes extremely important. And the third is from in almost every perspective, it's important to look at things as people do, as humans do. And if you sort of look at things from a people perspective, you look at things from an experience and innovation perspective, you look at things from fresh eyes, you are much more likely to differentiate, you're much more likely to be passionate about your business and the field. And overall, this is really the age of marketers, because marketers are the voice of people. And while boards have the voice of money and the voice of technology and the voice of other stakeholders, there's not enough in the voice of people. And as people get more empowered, this is particularly an age where we not only have to sort of see different, but think about see different, but think about different ways of innovating on experiences. Thank you, Alan. Alan Taylor Pleasure chatting with you. What next? A Publicist Group podcast produced by Prodigious UK. Thank you. Thank you."}, "podcast_summary": "In this captivating podcast episode, Alan Adamson, co-founder of Metaforce and brand management expert, discusses the key points of his new book, \"Seeing the How.\" He emphasizes the importance of experience innovation and the need for marketers to move beyond product differentiation. Adamson explains that building a brand based solely on product differences is becoming increasingly difficult in today's fast-paced, social media-driven world. Instead, he suggests focusing on how a product fits into consumers' lives and how it can enhance their experiences. He also emphasizes the importance of viewing opportunities with fresh eyes, as many threats and opportunities to a category come from outside of it. Furthermore, Adamson highlights the need for marketers to maintain their curiosity and observe people's lives in order to understand their needs and desires. Lastly, he reminds marketers to not always look to the new but to consider the right tools that can have a significant impact in the market. Overall, this episode provides valuable insights on how marketers can succeed in a rapidly changing landscape by prioritizing experience innovation, embracing fresh perspectives, and seeking to make people's lives better.", "podcast_guest": {"name": "Alan Adamson", "org": "Metaforce", "title": "", "summary": "Not Available"}, "podcast_highlights": "Highlight 1: \"Building a brand based on only a difference, a product difference, is harder and harder to do these days. So as I sat down to think about what are the next challenges, it became clear that, you know, just saying just find some product difference and go tell people about that was flawed because product differences, you know, maybe don't are hard to find and certainly harder to sustain.\" \n\nHighlight 2: \"Part of this book was saying, look, you could have a product that has a difference, that's great. But if you could figure out how it fits in someone's lives, how it changes their lives, how it makes their experience better, that's a more relevant message today going forward.\"\n\nHighlight 3: \"The other big change that I see going on is that marketers for years have been handed something by product development. Here's a new shampoo, here's a new car, it has a new coffee cup holder that's easier to access, and then your job is to go sell that. But the problem is that, you know, marketing should be more focused on if we in marketing know who the customer is, know their problems, can get inside their head and do a Vulcan mind meld, if you go back to Star Trek, then we should be driving what sort of product experiences the company should do, not just taking whatever is invented in the lab, and then trying to find a way to make it relevant and interesting to people.\"\n\nHighlight 4: \"If you try to do many things in marketing, you will likely be average at many things. And you'll do a TV commercial that's okay, you'll do some social media that's okay, you'll do an influencer strategy...but success is going to be more and more driven by doing a few things extraordinarily well.\"\n\nHighlight 5: \"Part of success today is trying to be more open and curious and a better observer of what's going on...because if you can't keep your eyes fresh, you'll be less valuable and less successful.\""}