{"podcast_details": {"podcast_title": "Future of UX", "episode_title": "#34 Niching Down for an Era of AI", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/2243667/2243667-1684249424425-58e6d28d187d.jpg", "episode_transcript": " Welcome back to the future of UX. In this podcast, we will talk about different niches for you as a UX designer. It gets pretty obvious that times are changing and that especially because of AI, a lot of things will be automated, the whole workflow will change. So it might be smart to niche down to position yourself very strategically for the future. And this is what this podcast episode will be about. We are going to talk about four niches that I think would be really interesting to have a look at for you or to maybe, yeah, see if that's something for you where you would like to focus, learn more about and then niche down. But first of all, welcome to the future of UX, the podcast where we explore the future of technologies and have a look at how we as designers can future proof our careers. My name is Patrizia Reinas. I'm your host for this podcast. I'm working as an innovation designer and consultant in Berlin. I have my own little studio here and you can find me on Instagram at UX.Patricia. So I would say let's get started with this episode. So I am having a lot of discussions at the moment with different people who are asking me if I have any recommendations, how to prepare yourself for an era of AI. As many of you know, I'm doing a lot of workshops at the moment with different agencies, but also with clients where I'm working very closely with the design team, where we have a very close look at what are the repetitive tasks, where can you actually integrate AI, where does it make sense and where does it not make sense at all. But also how to maybe reposition yourself, your agency, but also you as an individual to future proof. I mean, future proof is such a buzzword, but how can you make sure that your career and your skills still will be very valuable in the future? Things are changing, so there also might be some changes needed when it comes to your positioning and also your skill set. So in this episode, I want to share with you four niches or four ways to position yourself as a UX designer, especially that I find pretty interesting where I'm seeing a lot of demand at the moment and also talking a little bit about what are the different steps to get there, how to learn it and what are, I would say, some topics included in this niche. So what do you actually need to do when you niche down into that topic? Okay, so I would say let's get started with point number one, and this is spatial design or augmented reality, virtual reality. So everything that's beyond the normal screen that we are seeing at the moment. I mean, Apple just released their Apple Vision Pro and that already was like a pretty big step into that direction of spatial design. And at the moment, there are a lot of resources out there, not too many, but some. I already recorded a few podcast episodes already about the topic of spatial design, some design guidelines and use cases where I linked a lot of resources. So if it's interesting to you, definitely check it out. But overall, there is not a lot of content out there and there are also not a lot of designers who are specializing in that area. But almost every app you can think of will be needed to design for spatial design. It doesn't make sense for like every single app, but for many apps, it will make sense and a lot of clients will come to you and ask you to do that. So when we are thinking about augmented reality and these overlays of digital information onto the physical world, really enhancing the user's perception and interaction with their environment, for me, it's a very interesting, exciting area. And there are a lot of opportunities and unexplored areas to become, I would say, like an expert also to guide the client, to help them. What we are seeing at the moment with the Apple Vision Pro is that the interfaces are very, I would say, not so innovative, right? They just move the very same layouts and interface elements from the 2D space to the 3D space, which makes sense because people are used to these kind of designs. So it needs to be familiar. I totally get that. This will definitely change a little bit in the future. So there's a lot of things to explore. So what are three topics that I find especially interesting when it comes to spatial design? So, the first is, of course, defining and understanding the spatial design principles. That's absolutely crucial in AR and a lot will be very common to you if you know UX rules, if your background is UX, but some also might be a little bit different. Especially we need to consider how the virtual elements really blend seamlessly with the real world and ensuring that they align with the physical objects, the scale appropriately and react to their movements. So that's very different challenges, but super, super interesting. The second point when it comes to spatial design are definitely the interactions and there we are already seeing some interesting stuff from Apple. AR interfaces should definitely provide very intuitive and natural interactions. I mean, we are seeing that the Apple Vision Pro, Gestures, VoiceCommand and other input methods, they really need to be designed to feel very intuitive and enhancing the users' immersion and engagement. But also the last topic is the contextual relevance. I think this is also super interesting and their data will be very important. Object recognition, user preferences, so they are also like the whole AI topic will come in designing with AI products. Designing can really deliver these kind of like personalized and meaning AR content. Super exciting area and definitely worth checking out and starting with a few case studies. There's like I mentioned a lot of content out there. Also some resource that I shared on LinkedIn, you can find me there. I'm sharing there a lot of interesting resources that help you to get started with tutorials, with resources on Figma, etc. So you just need to check it out. Let's get to point number two. And this is ethical design. So what's ethical design? Ethical design really focuses on creating products and experiences that prioritize user well-being, privacy, but also the social impact. So not only focusing on the one single user and like a certain business goal, but more the long-term well-being and the social impact. And incorporating these ethical considerations into your X, there are a few things that are very important. The first, of course, is user privacy. Overall, of course, we need to respect user privacy by really minimizing data collection or being very transparent about the data usage and obtaining informed content. So there will be a lot of challenges because more and more data is being collected, especially with AI. And there are a lot of discussions already about that, also from users who want to know what is going on. And this topic will be very important. And we need ethical designers for it who will focus on that, who have background in it, who have some kind of like experience in it, also to guide clients and projects about the decisions how to get the user on board when it comes to privacy, especially like what is allowed, what is not allowed, how to like be really transparent about what is going on. Also, transparency and trust. Designing interfaces that are very transparent about the purpose, the capabilities and the limitations. So very, I would say, like clearly communicate to users how their data is being used. I already mentioned that. Also establish trust through open and honest interactions. I remember not too long ago, there was this thing called dark patterns. I haven't seen that for a super long time because I think, you know, the dark patterns is something that some kind of like tricks the user to do certain things that the user doesn't really want to do. For example, Ryanair, the flight company, you know, it's like a cheap flight company, odd was easy, I'm not 100% sure at the moment. They're selling flights like super cheap, as we all know, and they used to have, or they still have it, a lot of additional check marks that you could check. For example, pay for extra insurance, pay for an extra car rental, pay for many extra things. And they had one interface element where you could like select an insurance in case you get sick or something like that. And you needed to select the country. So there was like, I think it was already pre-checked. And then you needed to select the country. So like Germany or Belgium or France or something like that. And the no, I don't want insurance was not at the top, but at the, you know, it was arranged or it was sorted by alphabet. So it was at N. So a lot of users didn't find it. They thought, okay, I just need to pay the insurance anyway. Of course, some people reported it and they needed to remove it. But this was like a dark pattern, something that like tricking the user and doing something that the user doesn't want to do. But in the end, it's good for the business, right? So people, of course, used the or like paid for the insurance, although they maybe just didn't want or didn't needed it. And this is something that is not very common in the moment, not common anymore. You know, most designers know about dark patterns and this is like very bad for the reputation, especially if this gets public. So companies are not doing that. And it's there, of course, a lot of designers who are speaking up for not doing these kind of behaviors. When it comes to ethical design, some other really important topics is also inclusion and non-biased design. So really avoiding any kind of biases and stereotypes in design. If we still see these kinds of biases and designs, they quickly get public and there will be a lot of also super and it will end up in a very bad reputation for the company. So there's also a need for companies to have people who are looking over these processes and making sure that there are no biases or stereotypes involved. Also when it comes to design, when you use design products, of course, because of the data that that trained these services, there are still some biases in. So there is a need for dedicated people who kind of like check that. Also the whole topic of sustainability goes into the ethical design topic, really minimizing energy consumption, super hot, important topic. Also when it comes to AI who uses so much energy. So what we really need to do also in the future is to design for, yeah, longevity and recyclability. So sustainable and eco-friendly behaviors. There's definitely a lot of potential and one of the topics that is not so, I think there are not a lot of designers who are focusing on that topic at the moment, but there will be a huge demand in the future. Also because of regulations that will come sooner or later. So topic number three is accessibility. And accessibility in your ex design really focuses on ensuring that digital products and experiences are usable by individuals with disabilities or for everyone. So accessibility in the end is good for everyone because everyone can use it and understand it. And there are some important considerations. What is really important for us, especially in Europe, that there are also regulations that your website needs to be accessible and there are certain accessibility standards. So if they are not, we still have some time to work on that. But if they are not accessible and there are also some kind of like fines and fees on it, so a lot of companies are going to focus on the whole topic of accessibility. Although it's not a topic that is, I think, seen by many companies that it's like a sexy topic like sustainability, but this is also going to change. Accessibility is super important to keep everything on board. Also help the elderly generations to use digital product appropriately to get the most out of it and to help that everyone is included. I did a separate podcast episode about accessibility design and shared some learnings about how to get started when it comes to accessibility. So I will link it in the show notes. Definitely check it out. I think that's super interesting to you if you want to focus on the topic. And yeah, there are some very basic things that I can just like mention real quick when it comes to accessibility. Of course, you know, other visual topics like the color contrast, providing alternative text for images, use very clear typography, also consider users with visual impairment who may rely on screen readers or magnifiers. And I think this is like a very interesting thing. If you try a screen reader on the app or the product that you are designing at the moment, you will see there are a lot of challenges. So that definitely can be improved. Same with like keyboard accessibility or also any kind of assistive technologies. You know, thinking about screen readers, for example, or alternative input devices or voice control systems. So there are still a lot of things to explore and to make better. So in a very interesting challenge, especially in an era where so many things are automated, where like basic design is created by text prompts and all these accessibility problems are really difficult to grasp, to find a solution. And I say there's a lot of opportunity that really provides a positive value for society and in the end for all of us, because an accessible website is good for everyone, right? So visibility doesn't need to look ugly or something like that. There are a lot of good ways to still make it beautiful, but accessible for everyone. And of course, yeah, user testing is super important, test things out. So when you test your designs include like a huge variety of people, not only like the young mid 30 people who don't have any, some kind of like disabilities and a disability. Kat Holmes, she's an amazing designer. She used to work at Microsoft for a long time. I think now she's working on her own, did an interesting study about that and also wrote a book which is called Mismatch. And she said that when you're thinking about a disability, you're thinking about people, you know, someone who just has one arm, for example, and who lost one arm in a war or in an accident or something like that. But they are also, you know, temporary disabilities. For example, imagine like a young mother who has like, who's wearing or who was holding her baby in one arm, right? So she only has one hand to use for any kind of like interaction input methods. Or it could also be situational, this would be situational or temporary if you just have like a broken arm. Of course you will like, you will get better and you will get both arms back, but for that temporary period, you only have one. I think it's very interesting to also think about like the situational, like in the situation, the people who are not able to use all their senses and also the temporary topics. So a very interesting and important thing for the future and very good to focus on that, niche down on that and really become an expert in it. And the last but not least topic, and that probably won't be surprising to many of you, is the whole topic of AI. There are, there at the moment is like a huge amount for people who are working with AI, who know how AI really works, how you can integrate AI in your processes. So designers who really understand AI have a bright future ahead of them because they can use it, they understand it and they can make the most out of it. What I'm seeing, especially looking at the past, a lot of designers are still really scared about these kinds of technologies because they don't understand it, because it's very like difficult for them to grasp, but it's not the case. It's not that difficult. There are some very main and basic principles to understand and then you are becoming better and better in it and can use that in your day-to-day workflows. And that will be super interesting also for clients and stakeholders thinking about the whole topic of natural language processes of these large language models like chat GPT, how to really use these in a smart way, how does prompting looks like, of course for the image but also for the text generators. Super interesting. What does like personalization recommendation really means? How does it changes our interfaces? Super interesting using these AI algorithms, but also trust and transparency and very closely related I would say to the ethical part. So guys, if you're interested, especially in the last topic of AI and automation, I am doing another, I would say webinar course about it. I have already done one in April. A lot of people have joined. I think around a hundred people have joined and the feedback has been absolutely great and I'm getting a lot of questions and demands for another session of that where we really go over each step of the process of AI background information, then really how the workflows with AI looks like, the different tools and how you can use that to future proof your career. I am working on that webinar or that course at the moment. And if you think that might be an interesting topic for you, you can just sign up for the waiting list. Nothing is required. Just sign up, get notified if things are happening there and then you will be one of the first people who get notified when the course opens. So you're not missing it out because there will only be a very short timeframe where I'm opening up for sign up. And after that, it will be closed again, like in April. So if that's interesting, you can find that in the description box. Okay, friends. So niching down definitely might be an interesting topic focusing on the areas that won't be able to be automated quickly, but where you need much more strategic and research background and knowledge that AI won't be able to do because we haven't even gotten to a good solution. Spatial design, although there are some rules, there are a lot of challenges and things to tackle so that might be a really interesting and important thing to niche down. This was the first one. The second one is ethical designs for everything around transparency, trust, also privacy, sustainability, society center design, a super important big topic, right? Where we really move from focusing on the individual user, on the business goal, but more on society as a whole super important topic. And then number three, accessibility, really making sure that products are accessible to everyone, right? I'm not sure if I mentioned that earlier, but around 20% have some kind of disability and with many products, they are left out. So it's much smarter to really include these people and to have, yeah, to really understand what does product really make accessible, learn about it, and then that will be definitely a super high demand for it. And then the last topic is of course AI automation, how to use AI in a smart and a strategic way to boost your workflows, to use it in a good way, to understand what it means to understand what's possible and also how to write good prompts and how to integrate that into the day-to-day task and strategic challenges that you have in your day-to-day life. Okay friends, I hope this was helpful to you. If you want to learn more, I also have a free newsletter that you can sign up, get a lot of info, resources, a lot of good things, you can just sign up and then you get an email every Thursday with amazing news and insights right to your mailbox. It's short and sweet and definitely worth it. Thank you so much for listening, I wish you a wonderful day and hear you in the future."}, "podcast_summary": "In this podcast episode, the host discusses four niches for UX designers to consider in order to future-proof their careers. The first niche is spatial design or augmented reality/virtual reality. With the release of Apple Vision Pro, there is a growing demand for designers who specialize in designing for spatial experiences. The podcast also emphasizes the importance of understanding spatial design principles, interactions, and contextual relevance. \n\nThe second niche is ethical design, which focuses on creating products and experiences that prioritize user well-being, privacy, and social impact. Designers in this niche need to consider user privacy, transparency, trust, inclusion, and non-biased design. The podcast highlights the importance of minimizing data collection, being transparent about data usage, and establishing trust through open and honest interactions. \n\nThe third niche is accessibility, with a focus on ensuring that digital products and experiences are usable by individuals with disabilities. The podcast mentions the importance of meeting accessibility standards, improving color contrast, providing alternative text for images, and considering users with visual impairments or other disabilities. \n\nLastly, the podcast discusses the niche of AI and automation, where expertise in understanding AI algorithms and integrating AI into design workflows is highly sought after. Topics such as natural language processing, personalization, recommendation systems, trust, and transparency are mentioned as areas to focus on. The podcast also mentions a webinar/course being offered by the host on AI and automation for UX designers. \n\nIn conclusion, the podcast episode provides valuable insights into niche areas for UX designers to consider for future-proofing their careers: spatial design, ethical design, accessibility, and AI/automation. The host emphasizes the importance of understanding these niches, learning the necessary skills, and becoming an expert in these specialized areas.", "podcast_guest": {"name": "Not Available", "org": "Not Available", "title": "Not Available", "summary": "Not Available"}, "podcast_highlights": "Highlight 1: \"Almost every app you can think of will be needed to design for spatial design.\"\nHighlight 2: \"Ethical design really focuses on creating products and experiences that prioritize user well-being, privacy, but also the social impact.\"\nHighlight 3: \"Accessibility in UX design really focuses on ensuring that digital products and experiences are usable by individuals with disabilities or for everyone.\"\nHighlight 4: \"Niching down definitely might be an interesting topic, focusing on the areas that won't be able to be automated quickly.\"\nHighlight 5: \"The last topic is, of course, AI automation, how to use AI in a smart and strategic way to boost your workflows and understand what it means.\""}